tap "homebrew/services"
tap "jakehilborn/jakehilborn"
brew "act"
brew "zstd"
brew "atomicparsley"
brew "openssl@3"
brew "python@3.13"
brew "autojump"
brew "automake"
brew "bat"
brew "clang-format"
brew "convmv"
brew "deno"
brew "direnv"
brew "displayplacer"
brew "duckdb"
brew "ffmpeg"
brew "fnm"
brew "fonttools"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "hugo"
brew "libtool"
brew "imagemagick"
brew "jpegoptim"
brew "just"
brew "libev"
brew "mysql"
brew "neovim"
brew "nginx"
brew "nmap"
brew "ollama", restart_service: :changed
brew "oxipng"
brew "pandoc"
brew "pinentry-mac"
brew "pkgconf"
brew "pngquant"
brew "poetry"
brew "python@3.12"
brew "python@3.9"
brew "ripgrep"
brew "sqlmap"
brew "sysbench"
brew "tesseract-lang"
brew "tmux"
brew "tree"
brew "typst"
brew "unar"
brew "watch"
brew "woff2"
brew "zopfli"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password-cli"
cask "font-arvo"
cask "font-baskervville"
cask "font-crimson-pro"
cask "font-eb-garamond"
cask "font-genryumin"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-sc"
cask "font-inter"
cask "font-lxgw-neoxihei"
cask "font-lxgw-neozhisong"
cask "font-maple-mono-nf-cn"
cask "font-merriweather"
cask "font-nunito"
cask "font-nunito-sans"
cask "font-roboto"
cask "font-sf-pro"
cask "sf-symbols"
cask "temurin@17"
cask "temurin@21"
cask "temurin@8"
cask "zerotier-one"
go "github.com/rhysd/actionlint/cmd/actionlint"
go "github.com/Loyalsoldier/geoip"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
